doggdragon/RRRUUUNNN/RA4M2_MINI_DEMO/src/oled.c
#include "oled.h"
#include "stdlib.h"
#include "oledfont.h"

#include "hal_data.h"

#define OLED_I2C_ADDR_WRITE        (0x78U)
#define OLED_PIN_SCL               BSP_IO_PORT_04_PIN_08
#define OLED_PIN_SDA               BSP_IO_PORT_04_PIN_07

static void oled_i2c_delay(void)
{
    R_BSP_SoftwareDelay(2U, BSP_DELAY_UNITS_MICROSECONDS);
}

static void oled_scl_write(bsp_io_level_t level)
{
    R_IOPORT_PinWrite(&g_ioport_ctrl, OLED_PIN_SCL, level);
}

static void oled_sda_write(bsp_io_level_t level)
{
    R_IOPORT_PinWrite(&g_ioport_ctrl, OLED_PIN_SDA, level);
}

static void oled_i2c_start(void)
{
    oled_sda_write(BSP_IO_LEVEL_HIGH);
    oled_scl_write(BSP_IO_LEVEL_HIGH);
    oled_i2c_delay();
    oled_sda_write(BSP_IO_LEVEL_LOW);
    oled_i2c_delay();
    oled_scl_write(BSP_IO_LEVEL_LOW);
}

static void oled_i2c_stop(void)
{
    oled_sda_write(BSP_IO_LEVEL_LOW);
    oled_scl_write(BSP_IO_LEVEL_HIGH);
    oled_i2c_delay();
    oled_sda_write(BSP_IO_LEVEL_HIGH);
    oled_i2c_delay();
}

static void oled_i2c_send_byte(uint8_t dat)
{
    uint8_t i;

    for (i = 0; i < 8; i++)
    {
        oled_sda_write((dat & 0x80U) ? BSP_IO_LEVEL_HIGH : BSP_IO_LEVEL_LOW);
        oled_i2c_delay();
        oled_scl_write(BSP_IO_LEVEL_HIGH);
        oled_i2c_delay();
        oled_scl_write(BSP_IO_LEVEL_LOW);
        dat <<= 1;
    }

    /* ACK clock: keep SDA released (high) and ignore returned level. */
    oled_sda_write(BSP_IO_LEVEL_HIGH);
    oled_i2c_delay();
    oled_scl_write(BSP_IO_LEVEL_HIGH);
    oled_i2c_delay();
    oled_scl_write(BSP_IO_LEVEL_LOW);
}

u8 OLED_GRAM[144][8];
//反显函数
void OLED_ColorTurn(u8 i)
{
    if(i==0)
        {
            OLED_WR_Byte(0xA6,OLED_CMD);//正常显示
        }
    if(i==1)
        {
            OLED_WR_Byte(0xA7,OLED_CMD);//反色显示
        }
}

//屏幕旋转180度
void OLED_DisplayTurn(u8 i)
{
    if(i==0)
        {
            OLED_WR_Byte(0xC8,OLED_CMD);//正常显示
            OLED_WR_Byte(0xA0,OLED_CMD);
        }
    if(i==1)
        {
            OLED_WR_Byte(0xC0,OLED_CMD);//反转显示
            OLED_WR_Byte(0xA1,OLED_CMD);
        }
}



//写入一个字节
void Send_Byte(u8 dat)
{
    oled_i2c_send_byte(dat);
}

//发送一个字节
//mode:数据/命令标志 0,表示命令;1,表示数据;
void OLED_WR_Byte(u8 dat,u8 mode)
{
    oled_i2c_start();
    oled_i2c_send_byte(OLED_I2C_ADDR_WRITE);
    oled_i2c_send_byte(mode ? 0x40U : 0x00U);
    oled_i2c_send_byte(dat);
    oled_i2c_stop();
}

//开启OLED显示
void OLED_DisPlay_On(void)
{
    OLED_WR_Byte(0x8D,OLED_CMD);//电荷泵使能
    OLED_WR_Byte(0x14,OLED_CMD);//开启电荷泵
    OLED_WR_Byte(0xAF,OLED_CMD);//点亮屏幕
}

//关闭OLED显示
void OLED_DisPlay_Off(void)
{
    OLED_WR_Byte(0x8D,OLED_CMD);//电荷泵使能
    OLED_WR_Byte(0x10,OLED_CMD);//关闭电荷泵
    OLED_WR_Byte(0xAE,OLED_CMD);//关闭屏幕
}

//更新显存到OLED
void OLED_Refresh(void)
{
    u8 i,n;
    for(i=0;i<oled_y;i++)
    {
        OLED_WR_Byte(0xb0+i,OLED_CMD);
        OLED_WR_Byte(0x00,OLED_CMD);
        OLED_WR_Byte(0x10,OLED_CMD);

        oled_i2c_start();
        oled_i2c_send_byte(OLED_I2C_ADDR_WRITE);
        oled_i2c_send_byte(0x40U);
        for(n=0;n<oled_x;n++)
        {
            oled_i2c_send_byte(OLED_GRAM[n][i]);
        }
        oled_i2c_stop();
    }


    //    u8 i,n;
    //    for(i=0;i<oled_y;i++)
    //    {
    //        OLED_WR_Byte(0xb0+i,OLED_CMD); //设置行起始地址
    //        OLED_WR_Byte(0x00,OLED_CMD);   //设置低列起始地址
    //        OLED_WR_Byte(0x10,OLED_CMD);   //设置高列起始地址
    //        I2C_Start();
    //        Send_Byte(0x78);
    //        I2C_WaitAck();
    //        Send_Byte(0x40);
    //        I2C_WaitAck();
    //       for(n=0;n<oled_x;n++)
    //        {
    //            Send_Byte(OLED_GRAM[n][i]);
    //            I2C_WaitAck();
    //        }
    //        I2C_Stop();


//        /* ---- 1. 一次性设置 7-bit 从地址（如果你已在 BSP 中配置过，可删掉这行） ---- */
//        R_IIC_MASTER_SlaveAddressSet(&g_i2c_master0_ctrl,
//                                     0x3C,        /* SSD1312 默认地址：0x3C */
//                                     I2C_MASTER_ADDR_MODE_7BIT);
//        uint8_t buf[1 + oled_x];
//        buf[0] = 0x40;               /* 0x40 = “接下来是数据” 的控制字节 */
//
//
//        /* ---- 3. 逐页刷新 ---- */
//         for (uint8_t page = 0; page < oled_y; page++)
//         {
//             /* 3-1 设置页地址 & 列起始地址（仍用原有写命令函数） */
//             OLED_WR_Byte(0xB0 | page, OLED_CMD);      /* Page Address */
//             OLED_WR_Byte(0x00,         OLED_CMD);     /* Low Column  = 0 */
//             OLED_WR_Byte(0x10,         OLED_CMD);     /* High Column = 0 */
//
//             /* 3-2 把本页像素复制到发送缓冲（buf[1] ~ buf[oled_x]） */
//             for (uint8_t col = 0; col < oled_x; col++)
//             {
//                 buf[col + 1] = OLED_GRAM[col][page];
//             }
//
//
//             fsp_err_t err = R_IIC_MASTER_Write(&g_i2c_master0_ctrl,
//                                                buf,
//                                                (uint32_t)(oled_x + 1),  /* 总字节数 */
//                                                false);                  /* 发送 Stop 条件 */
//                     // 等待写入完成
//                     while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms > 0)
//                     {
//                         R_BSP_SoftwareDelay(100U, BSP_DELAY_UNITS_MICROSECONDS);
//                         timeout_ms--;
//                     }
//
//                     if (I2C_MASTER_EVENT_ABORTED == i2c_event)
//                     {
//                         __BKPT(); // 出错断点
//                     }
//
//                     i2c_event = I2C_MASTER_EVENT_ABORTED;
//                     timeout_ms = 100000;
//         }









}

void OLED_RefreshPage(u8 page)
{
    u8 n;

    if (page >= oled_y)
    {
        return;
    }

    OLED_WR_Byte((u8)(0xb0 + page), OLED_CMD);
    OLED_WR_Byte(0x00, OLED_CMD);
    OLED_WR_Byte(0x10, OLED_CMD);

    oled_i2c_start();
    oled_i2c_send_byte(OLED_I2C_ADDR_WRITE);
    oled_i2c_send_byte(0x40U);
    for (n = 0; n < oled_x; n++)
    {
        oled_i2c_send_byte(OLED_GRAM[n][page]);
    }
    oled_i2c_stop();
}
//清屏函数
void OLED_ClearBuffer(void)
{
    u8 i,n;
    for(i=0;i<8;i++)
    {
       for(n=0;n<128;n++)
            {
             OLED_GRAM[n][i]=0;//清除所有数据
            }
    }
}

void OLED_Clear(void)
{
    OLED_ClearBuffer();
    OLED_Refresh();//更新显示
}


//画点
//x:0~127
//y:0~63
//t:1 填充 0,清空
void OLED_DrawPoint(u8 x,u8 y,u8 t)
{
    u8 i,m,n;
    i=y/8;
    m=y%8;
    n=1<<m;
    if(t){OLED_GRAM[x][i]|=n;}
    else
    {
        OLED_GRAM[x][i]=~OLED_GRAM[x][i];
        OLED_GRAM[x][i]|=n;
        OLED_GRAM[x][i]=~OLED_GRAM[x][i];
    }
}

//画线
//x1,y1:起点坐标
//x2,y2:结束坐标
void OLED_DrawLine(u8 x1,u8 y1,u8 x2,u8 y2,u8 mode)
{
    u16 t;
    int xerr=0,yerr=0,delta_x,delta_y,distance;
    int incx,incy,uRow,uCol;
    delta_x=x2-x1; //计算坐标增量
    delta_y=y2-y1;
    uRow=x1;//画线起点坐标
    uCol=y1;
    if(delta_x>0)incx=1; //设置单步方向
    else if (delta_x==0)incx=0;//垂直线
    else {incx=-1;delta_x=-delta_x;}
    if(delta_y>0)incy=1;
    else if (delta_y==0)incy=0;//水平线
    else {incy=-1;delta_y=-delta_x;}
    if(delta_x>delta_y)distance=delta_x; //选取基本增量坐标轴
    else distance=delta_y;
    for(t=0;t<distance+1;t++)
    {
        OLED_DrawPoint(uRow,uCol,mode);//画点
        xerr+=delta_x;
        yerr+=delta_y;
        if(xerr>distance)
        {
            xerr-=distance;
            uRow+=incx;
        }
        if(yerr>distance)
        {
            yerr-=distance;
            uCol+=incy;
        }
    }
}
//x,y:圆心坐标
//r:圆的半径
void OLED_DrawCircle(u8 x,u8 y,u8 r)
{
    int a, b,num;
    a = 0;
    b = r;
    while(2 * b * b >= r * r)      
    {
        OLED_DrawPoint(x + a, y - b,1);
        OLED_DrawPoint(x - a, y - b,1);
        OLED_DrawPoint(x - a, y + b,1);
        OLED_DrawPoint(x + a, y + b,1);
 
        OLED_DrawPoint(x + b, y + a,1);
        OLED_DrawPoint(x + b, y - a,1);
        OLED_DrawPoint(x - b, y - a,1);
        OLED_DrawPoint(x - b, y + a,1);
        
        a++;
        num = (a * a + b * b) - r*r;//计算画的点离圆心的距离
        if(num > 0)
        {
            b--;
            a--;
        }
    }
}



//在指定位置显示一个字符,包括部分字符
//x:0~127
//y:0~63
//size1:选择字体 6x8/6x12/8x16/12x24
//mode:0,反色显示;1,正常显示
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 size1,u8 mode)
{
    u8 i,m,temp,size2,chr1;
    u8 x0=x,y0=y;
    if(size1==8)size2=6;
    else size2=(size1/8+((size1%8)?1:0))*(size1/2);  //得到字体一个字符对应点阵集所占的字节数
    chr1=chr-' ';  //计算偏移后的值
    for(i=0;i<size2;i++)
    {
        if(size1==8)
              {temp=asc2_0806[chr1][i];} //调用0806字体
        else if(size1==12)
        {temp=asc2_1206[chr1][i];} //调用1206字体
        else if(size1==16)
        {temp=asc2_1608[chr1][i];} //调用1608字体
        else if(size1==24)
        {temp=asc2_2412[chr1][i];} //调用2412字体
        else return;
        for(m=0;m<8;m++)
        {
            if(temp&0x01)OLED_DrawPoint(x,y,mode);
            else OLED_DrawPoint(x,y,!mode);
            temp>>=1;
            y++;
        }
        x++;
        if((size1!=8)&&((x-x0)==size1/2))
        {x=x0;y0=y0+8;}
        y=y0;
  }
}


//显示字符串
//x,y:起点坐标
//size1:字体大小
//*chr:字符串起始地址
//mode:0,反色显示;1,正常显示
void OLED_ShowString(u8 x,u8 y,u8 *chr,u8 size1,u8 mode)
{
    while((*chr>=' ')&&(*chr<='~'))//判断是不是非法字符!
    {
        OLED_ShowChar(x,y,*chr,size1,mode);
        if(size1==8)x+=6;
        else x+=size1/2;
        chr++;
  }
}

//m^n
u32 OLED_Pow(u8 m,u8 n)
{
    u32 result=1;
    while(n--)
    {
      result*=m;
    }
    return result;
}

//显示数字
//x,y :起点坐标
//num :要显示的数字
//len :数字的位数
//size:字体大小
//mode:0,反色显示;1,正常显示
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size1,u8 mode)
{
    u8 t,temp,m=0;
    if(size1==8)m=2;
    for(t=0;t<len;t++)
    {
        temp=(num/OLED_Pow(10,len-t-1))%10;
            if(temp==0)
            {
                OLED_ShowChar(x+(size1/2+m)*t,y,'0',size1,mode);
      }
            else
            {
              OLED_ShowChar(x+(size1/2+m)*t,y,temp+'0',size1,mode);
            }
  }
}

//显示汉字
//x,y:起点坐标
//num:汉字对应的序号
//mode:0,反色显示;1,正常显示
void OLED_ShowChinese(u8 x,u8 y,u8 num,u8 size1,u8 mode)
{
    u8 m,temp;
    u8 x0=x,y0=y;
    u16 i,size3=(size1/8+((size1%8)?1:0))*size1;  //得到字体一个字符对应点阵集所占的字节数
    for(i=0;i<size3;i++)
    {
        if(size1==16)
                {temp=Hzk1[num][i];}//调用16*16字体
        else if(size1==24)
                {temp=Hzk2[num][i];}//调用24*24字体
        else if(size1==32)
                {temp=Hzk3[num][i];}//调用32*32字体
        else if(size1==64)
                {temp=Hzk4[num][i];}//调用64*64字体
        else return;
        for(m=0;m<8;m++)
        {
            if(temp&0x01)OLED_DrawPoint(x,y,mode);
            else OLED_DrawPoint(x,y,!mode);
            temp>>=1;
            y++;
        }
        x++;
        if((x-x0)==size1)
        {x=x0;y0=y0+8;}
        y=y0;
    }
}

//num 显示汉字的个数
//space 每一遍显示的间隔
//mode:0,反色显示;1,正常显示
void OLED_ScrollDisplay(u8 num,u8 space,u8 mode)
{
    u8 i,n,t=0,m=0,r;
    while(1)
    {
        if(m==0)
        {
        OLED_ShowChinese(128,24,t,16,mode); //写入一个汉字保存在OLED_GRAM[][]数组中
            t++;
        }
        if(t==num)
            {
                for(r=0;r<16*space;r++)      //显示间隔
                 {
                    for(i=1;i<144;i++)
                        {
                            for(n=0;n<8;n++)
                            {
                                OLED_GRAM[i-1][n]=OLED_GRAM[i][n];
                            }
                        }
           OLED_Refresh();
                 }
        t=0;
      }
        m++;
        if(m==16){m=0;}
        for(i=1;i<144;i++)   //实现左移
        {
            for(n=0;n<8;n++)
            {
                OLED_GRAM[i-1][n]=OLED_GRAM[i][n];
            }
        }
        OLED_Refresh();
    }
}

//x,y：起点坐标
//sizex,sizey,图片长宽
//BMP[]：要写入的图片数组
//mode:0,反色显示;1,正常显示
void OLED_ShowPicture(u8 x,u8 y,u8 sizex,u8 sizey,u8 BMP[],u8 mode)
{
    u16 j=0;
    u8 i,n,temp,m;
    u8 x0=x,y0=y;
    sizey=sizey/8+((sizey%8)?1:0);
    for(n=0;n<sizey;n++)
    {
         for(i=0;i<sizex;i++)
         {
                temp=BMP[j];
                j++;
                for(m=0;m<8;m++)
                {
                    if(temp&0x01)OLED_DrawPoint(x,y,mode);
                    else OLED_DrawPoint(x,y,!mode);
                    temp>>=1;
                    y++;
                }
                x++;
                if((x-x0)==sizex)
                {
                    x=x0;
                    y0=y0+8;
                }
                y=y0;
     }
     }
}
//OLED的初始化
void OLED_Init(void)
{
//    GPIO_InitTypeDef  GPIO_InitStructure;
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);    //使能A端口时钟
//    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;
//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;         //推挽输出
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//速度50MHz
//    GPIO_Init(GPIOA, &GPIO_InitStructure);    //初始化PA0,1
//    GPIO_SetBits(GPIOA,GPIO_Pin_0|GPIO_Pin_1);
//
//    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;         //推挽输出
//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//速度50MHz
//    GPIO_Init(GPIOA, &GPIO_InitStructure);    //初始化PA2
//    GPIO_SetBits(GPIOA,GPIO_Pin_2);
//
//    OLED_RES_Clr();
//    delay_ms(200);
//    OLED_RES_Set();


    OLED_WR_Byte(0xAE,OLED_CMD);//--turn off oled panel

    OLED_WR_Byte(0x00,OLED_CMD);    /*set lower column address*/
    OLED_WR_Byte(0x10,OLED_CMD);    /*set higher column address*/

    OLED_WR_Byte(0xB0,OLED_CMD);    /*set page address*/

    OLED_WR_Byte(0x81,OLED_CMD);    /*contract control*/
    OLED_WR_Byte(0x5f,OLED_CMD);    /*128*/

    if(USE_HORIZONTAL==0)
    {
        OLED_WR_Byte(0x20,OLED_CMD);    /* Set Memory addressing mode (0x20/0x21) */
        OLED_WR_Byte(0x09,OLED_CMD);     /* 0x09 */

        OLED_WR_Byte(0xA1,OLED_CMD);    /*set segment remap  0XA1 */
        OLED_WR_Byte(0xC8,OLED_CMD);    /*Com scan direction   0Xc8  */
    }
    else if(USE_HORIZONTAL==90)
    {
        OLED_WR_Byte(0x20,OLED_CMD);    /* Set Memory addressing mode (0x20/0x21) */
        OLED_WR_Byte(0x02,OLED_CMD);     /* 0x02 */

        OLED_WR_Byte(0xA1,OLED_CMD);    /*set segment remap  0XA1 */
        OLED_WR_Byte(0xC0,OLED_CMD);    /*Com scan direction   0Xc0  */
    }
    else if(USE_HORIZONTAL==180)
    {
        OLED_WR_Byte(0x20,OLED_CMD);    /* Set Memory addressing mode (0x20/0x21) */
        OLED_WR_Byte(0x09,OLED_CMD);     /* 0x09 */

        OLED_WR_Byte(0xA0,OLED_CMD);    /*set segment remap  0XA0 */
        OLED_WR_Byte(0xC0,OLED_CMD);    /*Com scan direction   0Xc0  */
    }
    else if(USE_HORIZONTAL==270)
    {
        OLED_WR_Byte(0x20,OLED_CMD);    /* Set Memory addressing mode (0x20/0x21) */
        OLED_WR_Byte(0x02,OLED_CMD);     /* 0x02 */

        OLED_WR_Byte(0xA0,OLED_CMD);    /*set segment remap  0XA0 */
        OLED_WR_Byte(0xC8,OLED_CMD);    /*Com scan direction   0Xc8  */
    }

    OLED_WR_Byte(0xA4,OLED_CMD);    /*Disable Entire Display On (0xA4/0xA5)*/

    OLED_WR_Byte(0xA6,OLED_CMD);    /*normal / reverse*/

    OLED_WR_Byte(0xA8,OLED_CMD);    /*multiplex ratio*/
    OLED_WR_Byte(0x3F,OLED_CMD);    /*duty = 1/64*/

    OLED_WR_Byte(0xD3,OLED_CMD);    /*set display offset*/
    OLED_WR_Byte(0x00,OLED_CMD);    /*   0x20   */

    OLED_WR_Byte(0xD5,OLED_CMD);    /*set osc division*/
    OLED_WR_Byte(0x80,OLED_CMD);

    OLED_WR_Byte(0xD9,OLED_CMD);    /*set pre-charge period*/
    OLED_WR_Byte(0x22,OLED_CMD);

    OLED_WR_Byte(0xDA,OLED_CMD);    /* Set SEG Pins Hardware Configuration */
    OLED_WR_Byte(0x10,OLED_CMD);

    OLED_WR_Byte(0xdb,OLED_CMD);    /*set vcomh*/
    OLED_WR_Byte(0x30,OLED_CMD);

    OLED_WR_Byte(0x8d,OLED_CMD);    /*set charge pump enable*/
    OLED_WR_Byte(0x72,OLED_CMD);    /* 0x12:7.5V; 0x52:8V;  0x72:9V;  0x92:10V */
    OLED_Clear();
    OLED_WR_Byte(0xAF,OLED_CMD);
}
